jit21.html
<!DOCTYPE html>
<html lang="cn">
<head>
<!-- 2019-01-04 Fri 10:04 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>即时编译器函数库第21节中文文档</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Cauchy">
<link rel="stylesheet" href="https://cs2.swfu.edu.cn/org-info-js/org-manual.css" type="text/css">
</head>
<body>
<div id="content">
<h1 class="title">即时编译器函数库第21节中文文档</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org35efdbf">1. 移植应用工具集</a></li>
</ul>
</div>
</div>
<p>
本文翻译自<a href="https://www.gnu.org/software/libjit/doc/libjit_21.html#Porting">libjit移植到新的架构体系</a>，如有任何疑问，联系pqy7172@gmail.com。推荐你在电脑上查看此页面。
</p>

<p>
本章描述了将 <code>libjit</code> 移植到一个新的架构所需要做的事情。本文将假设读者已经熟悉编译器实现技术以及目标CPU的指令集。
</p>

<p>
在接下来的文档里，我们将会使用 <code>ARCH</code> 来指代架构体系的名字。通常，特别指定的CPU体系以小写字母出现（比如 <code>x86</code> ， <code>arm</code> ， <code>ppc</code> ）。按照惯例，所有后端函数都应该加上前缀 <code>_jit</code> ，
因为它们不是公共API的一部分。
</p>

<div id="outline-container-org35efdbf" class="outline-2">
<h2 id="org35efdbf"><span class="section-number-2">1</span> 移植应用工具集</h2>
<div class="outline-text-2" id="text-1">
<p>
将 <code>libjit</code> 移植到一个新的体系架构需要做的第一件事是移植 <code>jit_apply</code> 工具集。这为从你的应用程序或JIT代码中调用任意的C函数提供了支持。如果你对 <code>libffi</code> 或 <code>ffcall</code> 比较熟悉，
<code>jit_apply</code> 提供了类似的功能。
</p>

<p>
即使你不打算编写一个本机代码生成器，你依然需要将 <code>jit_apply</code> 移植到新的体系架构。
</p>

<p>
<code>libjit</code> 函数库利用gcc中的 <code>_builtin_apply</code> 来完成函数应用中的大部分困难的工作。这个gcc工具集接受三个参数：一个指向要调用函数的指针，一个包含寄存器参数的结构以及一个大小值，它用来表明有多少字节数被压栈以作调用。
</p>

<p>
<code>stack_args</code>
</p>
<blockquote>
<p>
hello
</p>
</blockquote>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Cauchy</p>
<p class="date">Created: 2019-01-04 Fri 10:04</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
